[
    {
        "product_id": "2",
        "product_name":"Construction Toy Train Set for Kids 4+",
        "product_reviews": [
            "Perfect to play with supervised with an adult. The kids really love it. I thought it might be a little slow for them, but nope, it gets their imaginations going. Put a tiny piece of paper on the track and say it's a pretend penny. Make a cardboard tunnel. Lots of FUN. Battery powered runs for weeks. Just be sure it's off or you will be buying batteries.",
            "These larger-scale Lionel trains are perfect for our kiddos who play more on the rough side. This is the 4th 'version' of those larger trains we purchased (we already have Polar Express, Diesel Construction, and Toy Story) and it did not disappoint. Great sounds, stays on the track, couplers keep train cars together. Couldn't ask for more.",
            "This is the 5th Lionel Ready to Play train set we have bought for our children. Great for young train lovers who are not ready for the more advanced sets. Fairly durable, all of our five sets are still running, despite abuse.",
            "The instructions are sparse, but assembly and operation are pretty easy to figure out. The plastic construction has me concerned about durability, but other reviewers are not critical of this. Looks great and works well.",
            "Excellent first train set. My child will be 3 in March and after one day has learned to operate it by himself. It's not the same Lionel we grew up with, but for the price, it's an excellent starter set.",
            "I have actually bought two of these. The Polar Express for my own enjoyment around the Christmas Tree every year and this one, the Pennsylvania Flyer for my grandson. They stay on the track and little ones can operate them. The sounds from the engine and control are well received by children.",
            "It's ok, nothing great, it's made out of cheap plastic, the tracks snap together. It doesn't have the magic of trains from back in the day. This is a sellout product from Lionel in my opinion.",
            "This thing was incredible. It managed to occupy not three, but FOUR toddlers for hours every day for a week as it chugged around the Christmas tree. Judging by the amount of trauma it went through at the hands of the kiddos, it seems pretty difficult to break. Worth every penny.",
            "Use I saw USED but good! I was a little skeptical, however when my train came I would have never noticed it was used! Fantastic quality! My two year loves it!!! The remote controls speed of the train, the lights, the noises. Very impressed with this product!",
            "My great-grandson will be 3 in July. I got him an electric train set and he broke one of the tracks and parts off of the train the first day. So I put it up and ordered this. I love this larger size. I can't say how durable it is since we just got it today, but working fine.",
            "Only used a few times at Christmas. My son recently brought the train out to play with it, and the remote won’t work. Changed batteries and everything. It seems the batteries are not being held in tight enough in remote to make proper contact.",
            "The Locomotive did not move only the sound worked. The exchange process was real easy. I am hoping the next one that arrives works. I like this train model and the removable cargo and design. I was real disappointed when it did not arrive.",
            "Easily put together. My 18 month old granddaughter loved it under the Christmas tree. it is very durable. Not cheaply made.",
            "Great toy for under the tree. I had three problems with it, though. First, I received the box with impact damage at one corner. Luckily, the toy was not damaged. Second, the toy did not arrive with any instructions. Thirdly, the center detent on the remote forward/reverse throttle tends to wander.",
            "It’s made very well, and makes all the right sounds. It was perfect for my toddler grandson. His eyes just lit up when I gave it to him.",
            "This little train was just the perfect size to put under the Christmas tree. Every one from 7 to 77 loved it. Just wish we’d had it years ago. It was so easy to put together.",
            "Not what we thought but still it's very cool.",
            "It was bigger than expected, such a joy to have this kind of quality toy for my toddler who loves trains. Enjoyment for many hours and easy to store until later."
        ]
    },
    {
        "product_id":3,
        "product_name":"Hot Bee Train Set - Train set",
        "product_reviews": [
            "Great Basic Trainset. We got this train set for my 2 1/2 year old and he’s obsessed with it. The steam coming from the smokestack looks amazing and it lasts a surprisingly long time for such a small amount of water...",
            "Nice train set! This is a really nice train set, especially at the price point (I purchased for $40 USD)...",
            "Well made. Track is easy to assemble, perfect for my Christmas train. Love the realistic sounds. Great bargain.",
            "CHHOOOOOCHOOOOOO. Great start we set! I got the metal version, and I really liked it for the price...",
            "Not the best train set. The price is obviously the selling point, which is also reflected on the product. Here are my issues with the train set...",
            "My son loves it. Bought this for my son’s 3rd b’day. It’s such a fun toy. We put it together quickly...",
            "Assembled with old ones. I did not expect 5 years old train set assembled with it. This one is large with 8 paths...",
            "nice train. stable, ease use, nice product.",
            "Kids will like it. Train set lookings amazing with steamer, it comes with remote control which can be used to steer wagon back and forth...",
            "Great First Train Set for 4 Year Old. Title: Christmas Train Set...",
            "Great. This is A good product, the pictures made it seem bigger then it is but I still like the train...",
            "My kid likes this one. Only flaw is it consumes battery too fast. All the features are good: smoke, music.",
            "A Train was all my grandson wanted for his Birthday. We got the train was awesome. The beauty is what I liked.",
            "On/off power switch is poor. Otherwise, it works as expected. I had to replace the power switch after a few hours of my grandson playing with the train...",
            "Great train. My toddler is enjoying his train. Not hard to put together for him.",
            "Love it! I bought this train for my nephew's birthday and he loves it! The steam is a nice touch that's enjoyable...",
            "It actually steams! Got this for our son. It’s a great size for his room and he loves that it actually steams.",
            "Train set for a kid. Got this train set for my 9 year old son who loves trains. He loves the smoke being given off from the engine...",
            "Nice train for older children. My 2 year old loves this train but there are very tiny pieces that attach the tracks that come off easily...",
            "Bad quality. After 3 months it broke.",
            "Cute train. My 4-year-old grandson loves this train but bored with it fairly quickly...",
            "It's so cute. I bought it and put it under the Christmas tree. It's very cute, but it has its drawbacks...",
            "You train. It was not very durable; it broke very easily.",
            "Good! We liked this train a lot! Very cute and well built...",
            "My grandson loved it! I love the steam and the sound. Just like a real train!:)",
            "Pretty decent little train. This train is pretty great, has held up to toddlers for at least three days now...",
            "Great for value. Great for value, but the image shows tracks crossing, and it does not come with enough pieces for that...",
            "The train works extremely well! The train has realistic sounds and smoke. It stays on the track...",
            "A great train set for young children. This is a terrific train set for my 4-year-old granddaughter..."
        ]
    },
    { 
        "product_id":1,
        "product_name":"Digital Commander DCC Equipped Ready To Run Electric Train Set - HO Scale",
        "product_reviews": [
            "The instructions were slightly lacking with expansion pack operation, but with the DC controller I figured out that turning to channel 10 then applying increased power is what will actually drive the track switches from the expansion track pack. I had to hook the switches in line before the main power connected to the track. Also, make sure all your loops only allow travel in one direction. If you try to connect a loop so the track runs backward onto itself, it seems like it will short circuit out and the trains won't run. All the track pieces went together nice and smoothly, the trains both started on channel 3 correctly. It was super easy to switch them to channel 1 and 2. They ran at the same time flawlessly. There are lots of good YouTube videos to help with ideas for layouts. I'd recommend this for kids 6-9 with adult assistance, and over 9 just show them how to be careful with the track connectors then let the kids work out the kinks. Overall a decent value for the quality and price.",
            "I love this DCC set. I have had it for 2 years. I have expanded my set on a 5 x 10 board to have 3 oval tracks connected by crossover tracks. I am running 4 trains at one time and it works great. One of my engines has sound and this works great too. I am using the original DCC controller that came with the set. I do not need the 5 amp add-on power that some reviewers think you may need. Bachmann makes quality products at a reasonable price.",
            "I have had this starter DCC set for about 2 months and have given the locomotives frequent use. I bought the Bachman Track Pack and this track plan fills my 4x8 layout. I replaced the track pack's 4 turnouts that are wired with DCC-powered turnouts. I have used 6 of the 10 EZ Commander DCC addresses with the 2 locos and 4 switches. Great fun. I am usually hard to please yet thus far I am pleased and this set introduced me to DCC HO gauge model railroading. All the accolades noted, would I repeat the purchase? I would not, and this is not from dissatisfaction with the set. It is from expanded knowledge of the hobby and realization that I would not want to expand the 4x8 layout with the Bachman all-in-one EZ Track. It is not as realistic as sectional track with a separate roadbed. You can put your own DCC layout together even if you are a beginner. Read and study. For about the same cost, you could go with a bit higher-end setup buying the components separately. Many options, but this could be one: Atlas HO sectional track with more than enough to fill a 4x8. Amazon has Atlas starter track packs. Maybe the Digitrax DCC starter components. A couple of the lower-priced Bachman DCC onboard locks like the ones that come with the Digital Commander will complete your start in model railroading. If you want to be thrifty and know you won’t eventually yearn for a room-filling railroad empire, go with the Bachman Commander and have fun! I plan to continue building my 4x8 layout and may even mate the EZ Track to higher-end sectional track with my next adjacent table. That's a little funky, but I think it can be done with some thought and study. Hope my sharing here may be useful to some of you. Forgive the typos!",
            "Once upon a time, I bought this train set as an introduction to DCC. That it did and it provided me with a year or so of enjoyment until I overloaded it. One way or another this set is a decent entry-level train set into DCC. Just beware of some possible manufacturing or storage errors. First off the set came packaged well, and despite a reckless UPS man it arrived at my front door with no damage. Upon setting the train set up on the floor and running the trains for a few hours, everything seemed well. So I packed it up again and took it to my layout, which was under construction. The DCC system as well as the track used in the set, were heavily used. Unfortunately, this is where the problem started. The F3, (red and silver locomotive) somehow managed to bend an axle. Sadly I didn't know about the warranty program, and pitched it. A week or so later after a visit to a train show, my brand new 2-8-0 steam locomotive developed a valve gear problem. All the metal pieces that connect the wheels together got tangled up, and the train seized up and ground to a halt. After a little work, I managed to get the valve gear back the way it was supposed to be, only to find out the inner axles had twisted and broken. The culprit turned out to be the manual switch used in this set. The frog of the switch, the piece that rerails the train after it crosses over the points themselves, was warped just slightly and made itself a hint too narrow. This caused certain locomotives to bend their axles slightly, eventually leading to total failure. After replacing that switch, not a single locomotive has had a problem on my layout. I was lucky that only two engines suffered this fate, however, this being said, I doubt it was Bachmann's fault. These train sets are designed to be sold at Hobby Stores, where there is climate control and AC, not the massive Amazon warehouses. Now, I'm not saying Amazon is totally at fault, but I am saying every train set I've bought from a local hobby store has been flawless, Bachmann or otherwise. And upon browsing the other train sets on amazon.com, I've noticed similar complaints. Trains not staying on the track, tracks not going together, derailment all the time, small pieces breaking off when taking out of the box, warped track, so on and so forth. Now my second train that I bought from Amazon has been flawless, I bought the Echo Valley Express as a replacement and it's been a bundle of fun. So I have a feeling that buying train sets from amazon.com can end up being a mixed bag. I recommend checking your local hobby shops first and then compare prices. Amazon is normally lower, so it's up to you whether the risk is worth the reward. As for the set itself, the blue and yellow diesel continues to be a hard worker on my layout. As I said I accidentally fried the first EZ command trying to get it to run a DC Loco that was nearly 40 years old. All the other track minus the switch is still in use. And the Rolling Stock is also perfectly adequate. Personally, if you want to see all the advantages of DCC I would pick this set up as long as you accept the fact it could be faulty. The value for money is well worth the risk, as long as you are insightful. Check your rolling stock after I would say 5 laps, check for extreme bumpiness when going over the switch, and listen to your models. Any buzzing, grinding, or any other noise out of the ordinary needs to be addressed. And should something go wrong remember that they have a lifetime warranty on all their equipment. Don't be a fool like me and throw some trains out. Also, one last word of advice. The EZ command is designed for small layouts. It only has enough power to run 3 trains at once despite having the ability to program 10. If you're buying this to upgrade an existing layout be aware of this. Bachman does offer a 5 amp power booster, and this would provide more than enough power to run any locomotive you want.",
            "I loved model trains as a child so I was excited to get my young son his first electric set. The box says 14 & up but I remember playing much earlier. The DCC controller allows you to run multiple trains independently, something that took a lot of work in the old days, and this set includes two train engines which is quite a bargain, I think. Set up was easy and the included video made understanding the DCC controller so simple that my son figured out how to turn the engine lights on and off just by overhearing the TV while playing. The snap-together track isn't perfect but it is pretty good and connecting the few wires is very simple and tool-less. Both engines pull the cars well and I have played with this set nearly as much as my son. The ability to add other engines including one analog train is very nice. In fact, we bought another set to go with this and have three engines going at once. My only complaint is with the rolling stock. The wheels fell off one of the cars right out of the box and it has been a tad problematic. We've only had it for a day so it's hard to say how durable this is yet. Overall, I'm very pleased with this set and I would recommend it to anyone interested in a train set. Getting two DCC engines, track, and a DCC controller for this price is pretty good. I just wish they offered a greater variety of engines in their starter sets.",
            "Had a great time setting it up and once it was all together the 6-year-old it was bought for was able to operate it with no problem. It did take him a while to master setting the trains on the tracks but it was not a problem as they cannot damage anything by attempting to master that skill (pretty much the hardest thing for the little guy to do). Straightforward controls once you read the instructions, you can set up several different engines on the switchboard they provide. It was bought for a Christmas gift and he is still playing with it regularly.",
            "The first set I received had a faulty power pack but amazon replaced it almost before I could tell them about it. The second is set up and running. The appearance is a bit better than I would expect from toy quality set, a bit cheap looking but adequate. The speed control is very smooth both forward and reverse. The track went together easily and has not vibrated loose, at least not yet. I knew nothing about DCC before buying this set and found it very easy to understand. The instruction DVD is plain language and informative. This is a very good choice for a back room set. I do recommend it. Forgot to mention why I took a star away. The electric motors are very loud and make quite a whine. The couplers also do not match height from car to car, or car to locomotive. These are minor things, I know.",
            "First let me say I am not a novice. I had quite a large system years ago (base of 2 ping pong tables, Two rail system with a turnout for a yard, accessories including electronic yard warnings, lighted passenger cars (which my wife and I installed), and others. I only got rid of this system because we moved and didn't have the space. Therefore the following. Normally I would have given Bachmann a much higher review (4 *). However, their QC sucks. The controller I received does not match the one in the instructions. But I tried to work with it, anyway. What a pain. 1. No on off switch 2. Directional signals are up down instead of left and right (not a big deal, but worth mentioning). 3. The back of the controller in the instruction does not match the one I received. 4. No import for accessories 5. DSL port on the controller - not in instructions (I expect this is the connection for accessories. Then there's the EZ tracks. They were sub-par. Some were difficult to put together (pin alignment etc.) I have been able to get both locomotives running on different buttons but not at the same time. It took quite a lot of trial and error to achieve both of them running at all. If you don't have experience with model trains and a lot of patience you will be very disappointed. I guess I have run out of patience. I am hoping this review reaches Bachmann. If not I will send them a message.",
            "From an appearance standpoint the trains look great. However, trains derail frequently; train to rail alignment is a challenge which is why the track to track connections are critical to trains remaining running. Side Note: the analog connection wire was missing when the Trains were delivered. I contacted the Company's Customer Service team and their comment was 'Oh, that happens a lot. We will send you a replacement connector'. It never arrived. Also, the Train Controller Unit operates on the function 3 setting but defaults to function 1 anytime there is a derailment or train stoppage. If you are interested in more than appearance keep looking.",
            "A real disappointment. Clever layout with two good-looking locomotives that just don’t perform with the digital control. Very inconsistent operation, buttons switch over randomly to a different function, trains constantly derail. Best to look elsewhere and skip the allure of twin locomotives.",
            "Perfect for converting to digital.",
            "Bought this for my 8-year-old for Christmas. The layout went together fine and the cars and engines seem to run well. Unfortunately, the command controller fried after about 30 minutes of use, I think because of a derailment. We sent it in, and it took a solid 6 weeks to get it fixed/replaced. Luckily, our hobby shop let me borrow a DCC controller until we got our replacement back. So, aside from the quality of the DCC controller, we really like the set.",
            "Bought as my starter set into model railroading. The EZ track is very easy to put together and I had trains running in no time. The DCC command is easy to use but it never took long before I wanted to expand into a bigger layout. I started using Atlas track and flex track so eliminated the EZ track, then wanted a better DCC system so replaced the Bachmann one. The locomotives are very basic and lack detail and the DCC decoders are not great. One locomotive made terrible noises due to the decoder so I replaced them with NCE replacement decoders. The rolling stock is ok. This is a good set if you will stay with EZ track and the Bachmann DCC command, otherwise just buy the better components separately.",
            "The train set was exactly what we needed. Being new to model trains, my son received a DCC sound equipped steam engine for Christmas as well as some Bachmann expansion track. The problem was his existing model train set was an Atlas and didn't have a DCC controller. The Bachmann track is incompatible with Atlas and he couldn't use all the functionality of the new engine. So, we decided to switch him from Atlas to Bachman and we found that this train set was the best way to get into Bachmann and a digital command controller. It was available at a great price and works great.",
            "Just follow the instructions on setting up the DCC for the engines. I have the F unit facing backward going forward with the GPU unit. I also bought more track to make the set longer to add more cars.",
            "Not even close to worth the price. The lights on both locomotives didn't work. There is no on-off switch on the power source, so it has to be unplugged. Derailed easily. One car wouldn't couple. Returned and ordered a Lionel. We'll see how that goes. Lionel Superchief was the way to go. Very happy with it.",
            "When I opened the box, it looked like it was returned from someone else before. All parts were loose even when the wraps were there, one of the figures came broke. Nothing without repair with a little glue. Bad shipping, good product.",
            "The track is hard to stay connected. The command control was defective. Had to send it back to Bachmann. Not a happy puppy.",
            "Excellent product, fast delivery.",
            "Got me started in a hurry. Good quality and value.",
            "My only concern for not giving a 5-star rating was that the instructions for a novice weren't very clear or helpful. I had to do a lot of research on the web to figure out how to hook things up. Otherwise, a great value.",
            "This train set was a perfect purchase for our nine-year-old grandchild. It is easy to set up, easy to run, and the DCC enables the train set to easily add extra tracks and boxcars.",
            "We purchased this set as a gift for our 9-year-old son. One of the trains was broken right out of the box. I considered returning the whole thing to Amazon, but since one train did work, we decided to keep it and just return the one broken train to Bachmann. What a mistake! Bachmann says it will take 6 weeks to replace the train. 6 weeks to replace something that was broken right out of the box. THIS IS UNACCEPTABLE! Bachmann should immediately replace the defective train. I should have sent the whole thing back to Amazon for a full refund. No Bachmann trains this Xmas - their Customer Service is terrible.",
            "Being as this set enables you to run more trains at once, it makes for a much more interesting hobby and is a more realistic setup. Had to get our son to do the programming though, as this is not my strong point. This has made an old man very happy, highly recommended.",
            "I bought this set in the hopes to someday be able to get into trains a little more and that maybe my son will enjoy them with me. Very affordable and easy to use. Again, nothing more than a starter kit."
        ]
    }
]